<a href="https://colab.research.google.com/github/valogonor/ALS-Data-Engineer-Exercise/blob/master/ALS_Data_Engineer_Exercise.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
cons = pd.read_csv('https://als-hiring.s3.amazonaws.com/fake_data/2020-07-01_17%3A11%3A00/cons.csv')
cons.head()

   cons_id prefix firstname  ... modified_user status note
0        1    NaN       NaN  ...          6349      1  NaN
1        2    NaN       NaN  ...          5698      1  NaN
2        3    NaN       NaN  ...          1175      1  NaN
3        4    Ms.      Mark  ...          3984      1  NaN
4        5    NaN       NaN  ...          6062      1  NaN

[5 rows x 29 columns]

In [2]:
email = pd.read_csv('https://als-hiring.s3.amazonaws.com/fake_data/2020-07-01_17%3A11%3A00/cons_email.csv')
email.head()

   cons_email_id  cons_id  cons_email_type_id  ...  modified_user status note
0              1   548198                3361  ...           7595      1  NaN
1              2   491137                2474  ...           3248      1  NaN
2              3   413429                5175  ...           7405      1  NaN
3              4   347346                4117  ...           7713      1  NaN
4              5   443000                6781  ...           8618      1  NaN

[5 rows x 16 columns]

In [3]:
subs = pd.read_csv('https://als-hiring.s3.amazonaws.com/fake_data/2020-07-01_17%3A11%3A00/cons_email_chapter_subscription.csv')
subs.head()

   cons_email_chapter_subscription_id  ...               modified_dt
0                                   1  ...  Thu, 1990-06-28 10:54:20
1                                   2  ...  Thu, 1979-09-20 06:02:35
2                                   3  ...  Sun, 1974-03-03 15:11:50
3                                   4  ...  Wed, 1995-09-13 23:45:03
4                                   5  ...  Sat, 1983-12-10 08:09:58

[5 rows x 6 columns]

In [4]:
len(cons), len(email), len(subs)

(700000, 1400000, 350000)

In [5]:
people = cons[['cons_id']]
people.head()

   cons_id
0        1
1        2
2        3
3        4
4        5

In [6]:
# I chose an outer join in order to keep all the available information.
people = people.merge(email[['cons_email_id', 'cons_id', 'email']], how='outer', on='cons_id')
people.head()

   cons_id  cons_email_id                       email
0        1       546912.0         daniel72@hudson.com
1        1       560549.0   misty66@walsh-hampton.biz
2        1      1244042.0        lucassmith@yahoo.com
3        2       415587.0   caustin@spears-carson.com
4        2       642652.0  deborah57@shaffer-reed.org

In [7]:
len(people)

1494361

In [8]:
people = people.merge(cons[['cons_id', 'source']], on='cons_id', how='outer')
people.head()

   cons_id  cons_email_id                       email    source
0        1       546912.0         daniel72@hudson.com    google
1        1       560549.0   misty66@walsh-hampton.biz    google
2        1      1244042.0        lucassmith@yahoo.com    google
3        2       415587.0   caustin@spears-carson.com  facebook
4        2       642652.0  deborah57@shaffer-reed.org  facebook

In [9]:
people = people.merge(subs[['cons_email_id', 'isunsub']], on='cons_email_id', how='outer')
people.head()

   cons_id  cons_email_id                       email    source  isunsub
0        1       546912.0         daniel72@hudson.com    google      NaN
1        1       560549.0   misty66@walsh-hampton.biz    google      NaN
2        1      1244042.0        lucassmith@yahoo.com    google      NaN
3        2       415587.0   caustin@spears-carson.com  facebook      1.0
4        2       642652.0  deborah57@shaffer-reed.org  facebook      1.0

In [10]:
len(people)

1568877

In [11]:
people = people.merge(cons[['cons_id', 'create_dt', 'modified_dt']], on='cons_id', how='outer')
people.head()

   cons_id  cons_email_id  ...                 create_dt               modified_dt
0        1       546912.0  ...  Fri, 1983-08-26 06:02:03  Sun, 2015-12-27 09:28:02
1        1       560549.0  ...  Fri, 1983-08-26 06:02:03  Sun, 2015-12-27 09:28:02
2        1      1244042.0  ...  Fri, 1983-08-26 06:02:03  Sun, 2015-12-27 09:28:02
3        2       415587.0  ...  Mon, 1979-03-05 21:08:54  Tue, 1989-06-20 13:28:57
4        2       642652.0  ...  Mon, 1979-03-05 21:08:54  Tue, 1989-06-20 13:28:57

[5 rows x 7 columns]

In [12]:
people = people.rename(columns={'source': 'code','isunsub': 'is_unsub', 'create_dt': 'created_dt', 'modified_dt': 'updated_dt'})
people.head()

   cons_id  cons_email_id  ...                created_dt                updated_dt
0        1       546912.0  ...  Fri, 1983-08-26 06:02:03  Sun, 2015-12-27 09:28:02
1        1       560549.0  ...  Fri, 1983-08-26 06:02:03  Sun, 2015-12-27 09:28:02
2        1      1244042.0  ...  Fri, 1983-08-26 06:02:03  Sun, 2015-12-27 09:28:02
3        2       415587.0  ...  Mon, 1979-03-05 21:08:54  Tue, 1989-06-20 13:28:57
4        2       642652.0  ...  Mon, 1979-03-05 21:08:54  Tue, 1989-06-20 13:28:57

[5 rows x 7 columns]

In [13]:
people.columns

Index(['cons_id', 'cons_email_id', 'email', 'code', 'is_unsub', 'created_dt',
       'updated_dt'],
      dtype='object')

In [14]:
for col in people.columns:
    print(col, type(people[col][0]))

cons_id <class 'numpy.int64'>
cons_email_id <class 'numpy.float64'>
email <class 'str'>
code <class 'str'>
is_unsub <class 'numpy.float64'>
created_dt <class 'str'>
updated_dt <class 'str'>

In [15]:
people.dtypes

cons_id            int64
cons_email_id    float64
email             object
code              object
is_unsub         float64
created_dt        object
updated_dt        object
dtype: object

In [16]:
people['is_unsub'].value_counts()

1.0    315474
0.0     34526
Name: is_unsub, dtype: int64

In [17]:
len(people)

1568877

In [18]:
%%time
# Converting dates to datetime
cols = ['created_dt', 'updated_dt']
for col in cols:
    people[col] = pd.to_datetime(people[col])

CPU times: user 5min 22s, sys: 22.8 ms, total: 5min 22s
Wall time: 5min 22s

In [19]:
people.isna().sum()

cons_id                0
cons_email_id      94361
email              94361
code              783783
is_unsub         1218877
created_dt             0
updated_dt             0
dtype: int64

In [20]:
# Converting ID and boolean back to ints
# I chose to leave NaNs or blanks in the dataframe so that the information can
# be filled in as it is acquired
cols = ['cons_email_id', 'is_unsub']
for col in cols:
    people[col] = people[col].apply(lambda x: int(x) if x == x else '')
people.head()

   cons_id cons_email_id  ...          created_dt          updated_dt
0        1        546912  ... 1983-08-26 06:02:03 2015-12-27 09:28:02
1        1        560549  ... 1983-08-26 06:02:03 2015-12-27 09:28:02
2        1       1244042  ... 1983-08-26 06:02:03 2015-12-27 09:28:02
3        2        415587  ... 1979-03-05 21:08:54 1989-06-20 13:28:57
4        2        642652  ... 1979-03-05 21:08:54 1989-06-20 13:28:57

[5 rows x 7 columns]

In [21]:
people.dtypes

cons_id                   int64
cons_email_id            object
email                    object
code                     object
is_unsub                 object
created_dt       datetime64[ns]
updated_dt       datetime64[ns]
dtype: object

In [22]:
people.isna().sum()

cons_id               0
cons_email_id         0
email             94361
code             783783
is_unsub              0
created_dt            0
updated_dt            0
dtype: int64

In [23]:
people.tail()

         cons_id cons_email_id  ...          created_dt          updated_dt
1568872   699999       1121156  ... 1998-06-02 01:24:00 2014-06-01 11:16:45
1568873   700000         92309  ... 1989-02-15 17:34:48 2020-04-30 19:39:18
1568874   700000        568843  ... 1989-02-15 17:34:48 2020-04-30 19:39:18
1568875   700000        963789  ... 1989-02-15 17:34:48 2020-04-30 19:39:18
1568876   700000       1199889  ... 1989-02-15 17:34:48 2020-04-30 19:39:18

[5 rows x 7 columns]

In [24]:
cons['create_dt'] = pd.to_datetime(cons['create_dt'])
cons['create_dt'] = cons['create_dt'].dt.date

In [25]:
acquisitions = cons[['cons_id', 'create_dt']]
acquisitions.head()

   cons_id   create_dt
0        1  1983-08-26
1        2  1979-03-05
2        3  2008-08-22
3        4  1984-04-29
4        5  2007-07-19

In [26]:
# Grouping the acquisitions by date
dates = acquisitions.groupby('create_dt').groups

In [27]:
len(dates)

18445

In [29]:
data = {'acquisition_date': list(dates.keys()), 'acquisitions': [len(dates[date]) for date in dates]}

In [30]:
acquisition_facts = pd.DataFrame(data=data)
acquisition_facts.head()

  acquisition_date  acquisitions
0       1970-01-01            34
1       1970-01-02            38
2       1970-01-03            32
3       1970-01-04            39
4       1970-01-05            44

In [31]:
# Making sure the number of dates in the dataframe match the number of dates in
# the dictionary
len(acquisition_facts) == len(dates)

True

In [32]:
people.to_csv('people.csv', index=False)

In [33]:
acquisition_facts.to_csv('acquisition_facts.csv', index=False)